district9prawn/rx72t-canbus-demo/trash/2023-11-13-13-29-48/src/smc_gen/r_can_rx/src/r_can_rx.c
            /* Set to Not Sleep, and ensure that RCAN exits in Operate mode.
            HW manual note says to write to the SLPM bit in CAN Halt mode,
            but if we currently are in Sleep mode, we should already also be
            in Halt mode. (See ENTERSLEEP_CANMODE below). */
            can_block_p->CTLR.BIT.SLPM = CAN_NOT_SLEEP;
            while ((can_block_p->STR.BIT.SLPST) && DEC_CHK_CAN_SW_TMR)
            {
                R_BSP_NOP();
            }
            if (0 == can_tmo_cnt)
            { 
                api_status = R_CAN_SW_WAKEUP_ERR;
            }
            R_CAN_Control(ch_nr, RESET_CANMODE);
            break;
        case ENTERSLEEP_CANMODE:

            /* Set to, and ensure that RCAN returns in, the Sleep state.
            Write to the SLPM bit in CAN Reset or CAN Halt modes. */
            api_status = R_CAN_Control(ch_nr, HALT_CANMODE);

            can_block_p->CTLR.BIT.SLPM = CAN_SLEEP;
            while ((!can_block_p->STR.BIT.SLPST) && DEC_CHK_CAN_SW_TMR)
            {
                R_BSP_NOP();
            }
            if (0 == can_tmo_cnt)
            {
                api_status = R_CAN_SW_SLEEP_ERR;
            }
        break;

        case RESET_CANMODE:

            /* Set to, and ensure that RCAN returns in, the Reset state. */
            can_block_p->CTLR.BIT.CANM = CAN_RESET;
            while ((!can_block_p->STR.BIT.RSTST) && DEC_CHK_CAN_SW_TMR)
            {
                /* Wait loop. */ ;
            }
            if (0 == can_tmo_cnt)
            {
                api_status = R_CAN_SW_RST_ERR;
            }
        break;

        case HALT_CANMODE:

            /* Set to, and ensure that RCAN returns in, the Halt state. */
            /* The CAN module enters CAN Halt mode after waiting for the end of 
            message reception or transmission. */
            can_block_p->CTLR.BIT.CANM = CAN_HALT;
            while ((!can_block_p->STR.BIT.HLTST) && DEC_CHK_CAN_SW_TMR)
            {
                /* Wait loop. */ ;
            }
            if (0 == can_tmo_cnt)
            {
                api_status = R_CAN_SW_HALT_ERR;
            }
        break;

        case OPERATE_CANMODE:  

            /* Take CAN out of Stop mode. */    
            can_module_stop_state_cancel(ch_nr); /* exit module stop state */

            /* Set to Operate mode. */
            can_block_p->CTLR.BIT.CANM = CAN_OPERATION;

            /* Ensure that RCAN is in Operation mode. */
            while (((can_block_p->STR.BIT.HLTST) || (can_block_p->STR.BIT.RSTST)) && DEC_CHK_CAN_SW_TMR)
            {
                /* Wait loop. */ ;
            }
            if (0 == can_tmo_cnt)
            {
                api_status = R_CAN_SW_RST_ERR;
            }
        break;
        default:
            api_status = R_CAN_BAD_ACTION_TYPE;
        break;
    }

    return (api_status);
}
/******************************************************************************
 End of function R_CAN_Control
 *****************************************************************************/ /* end R_CAN_Control() */

/***********************************************************************************************************************
* Function Name: R_CAN_TxSet
********************************************************************************************************************//**
* @brief Set up a mailbox to transmit. The API will write to a mailbox the specified ID, data length and data
* frame payload, then set the mailbox to transmit mode and send a frame onto the bus by calling R_CAN_Tx().
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mb_mode - Normal mailbox (0), FIFO mailbox (1).
* @param[in] mbox_nr - Mailbox to use.
* @param[in] frame_p - Pointer to a data frame structure in memory. It is an address to the data structure containing
* the ID, DLC and data that constitute the data frame the mailbox will transmit.
* @param[in] frame_type \n
*  DATA_FRAME      Send a normal data frame.\n
*  REMOTE_FRAME    Send a remote data frame request.
* @retval R_CAN_OK                The mailbox was set up for transmission.
* @retval R_CAN_SW_BAD_MBX        Bad mailbox number.
* @retval R_CAN_BAD_CH_NR         The channel number does not exist.
* @retval R_CAN_BAD_MODE          The mode number does not exist.
* @retval CAN_ERR_BOX_FULL        Receive FIFO is full (4 unread messages).
* @retval R_CAN_BAD_ACTION_TYPE   No such action type exists for this function.
* @details This function sets up transmitting for normal mailboxes or transmit FIFO mailboxes.\n
* To transmit FIFO mailboxes, this function first interrupt disables the mailbox temporarily when setting up the maibox.
* It then check to ensure transmit FIFO is not full to perform setting up the mailbox: Copies the data frame payload
* bytes (0-7) into the mailbox, selects data frame or remote frame request, sets the ID value for the mailbox and
* finally the Data Length Code indicated by frame_p. The mailbox is interrupt enabled as well as transmit FIFO interrupt
* generation timing again unless USE_CAN_POLL was defined. Finally R_CAN_Tx is called to deliver the message.\n
* To normal mailboxes, this function first waits for any previous transmission of the specified mailbox to complete.
* It then interrupt disables the mailbox temporarily when setting up the mailbox: Sets the ID value for the mailbox,
* the Data Length Code indicated by frame_p, selects dataframe or remote frame request and finally copies the data frame
* payload bytes (0-7) into the mailbox. The mailbox is interrupt enabled again unless USE_CAN_POLL was defined.
* Finally R_CAN_Tx is called to deliver the message.
*/
uint32_t R_CAN_TxSet(const uint32_t         ch_nr,
                     const uint32_t         mb_mode,
                     const uint32_t         mbox_nr,
                     const can_frame_t*     frame_p,
                     const uint32_t         frame_type)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t    api_status = R_CAN_OK;
    uint32_t    i;

