district9prawn/rx72t-canbus-demo/trash/2023-11-13-13-29-48/src/smc_gen/r_can_rx/src/r_can_rx.c
    /* check mailbox mode */
    CHECK_MBX_MODE

    /* check mailbox for fifo mode: normal mailbox: 0 --> 23,
     * Transmit fifo mailbox: 24 --> 27;
     * return if number of mailbox is receive fifo mailbox(28 -->31) or higher */
    if(FIFO_MAILBOX_MODE == mb_mode )    /* check normal or fifo mailbox mode */
    {
        /* return if MBX is receive FIFO mailbox */
        CHECK_TXFIFO_MBX_NR
    }
    else
    {
        CHECK_MBX_NR
    }

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    if((FIFO_MAILBOX_MODE == mb_mode) && (bit_set[mbox_nr] & 0x0f000000))    /* check fifo mailbox mode and using FIFO mailbox */
    {
        /* In FIFO mailbox mode, change the bits in MIER for the related FIFO only when
         * the TFE bit in TFCR is 0 and the TFEST flag is 1 */
        if((can_block_p->TFCR.BIT.TFE == 0) && (can_block_p->TFCR.BIT.TFEST == 1))
        {
            /* Interrupt disable the mailbox.in case it was a receive mailbox */
            can_block_p->MIER.LONG &= ((~(bit_set[24])));
        }

        /* return if transmit fifo mailbox is full */
        if(can_block_p->TFCR.BIT.TFFST == 1)
        {
            return (CAN_ERR_BOX_FULL);
        }

        /* Copy frame data into mailbox */
        for (i = 0; ((i < frame_p->dlc) && (i<8)); i++)
        {
            can_block_p->MB[24].DATA[i] = frame_p->data[i];
        }

        /* Frame select: Data frame = 0, Remote = 1 */
        if (REMOTE_FRAME == frame_type)
        {
            can_block_p->MB[24].ID.BIT.RTR = 1;
        }
        else
        {
            can_block_p->MB[24].ID.BIT.RTR = 0;
        }

        /*** Set Mailbox ID based on ID mode ***/
        if (frame_p->id & XID_MASK)    /* Check for XID flag bit set in ID field */
        {
            /* Set message mailbox buffer Extended ID, masking off temporary XID flag bit. */
            can_block_p->MB[24].ID.LONG = (frame_p->id & (~XID_MASK));

            if (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM)
            {
                can_block_p->MB[24].ID.BIT.IDE = 1;   /* Mixed mode; select to send extended frame. */
            }
        }
        else
        {
            /* Set message mailbox buffer Standard ID.
             * Put only the lower 11 bit in the SID. */
            can_block_p->MB[24].ID.BIT.SID = (frame_p->id & SID_MASK);

            /* Always set IDE to 0 (unless mixed mode and extended frame as above). */
            can_block_p->MB[24].ID.BIT.IDE = 0;
        }

        /* Set the Data Length Code */
        can_block_p->MB[24].DLC = (unsigned short)frame_p->dlc;

        #if (USE_CAN_POLL == 0)
        /* In FIFO mailbox mode, change the bits in MIER for the related FIFO only when
         * the TFE bit in TFCR is 0 and the TFEST flag is 1 */
            if((can_block_p->TFCR.BIT.TFE == 0) && (can_block_p->TFCR.BIT.TFEST == 1))
            {
                /* Interrupt enable the mailbox */
                can_block_p->MIER.LONG |= (bit_set[24]);

                /* Generate interrupt when FIFO last message transmission completed */
                if(CAN_CFG_TXFIFO_INT_GEN_TIMING == 1)
                {
                    can_block_p->MIER.LONG |= (bit_set[25]);
                }
            }
        #endif

        if(can_block_p->TFCR.BIT.TFEST == 1) /* confirm that the transmit FIFO empty status bit is set to 1. */
        {
            can_block_p->TFCR.BIT.TFE = 1; /* Transmit FIFO enabled. */
        }

        api_status |= R_CAN_Tx(ch_nr, mb_mode, mbox_nr);
    }

    /* Content of below else will occur in 2 case:
     * 1: Transmit message by MBX normal in FIFO mailbox mode when FIFO_MAILBOX_MODE == mb_mode
     * 2: Transmit message by MBX normal in normal mailbox mode when FIFO_MAILBOX_MODE != mb_mode */
    else
    {
        /* Wait for any previous transmission to complete. */
        api_status = can_wait_tx_rx(ch_nr, mbox_nr);
        /* Interrupt disable the mailbox.in case it was a receive mailbox */
        can_block_p->MIER.LONG &= ((~(bit_set[mbox_nr])));

        /* Clear message mailbox control register. TRMREQ/RECREQ already 0 after can_wait_tx_rx(). (No need to write twice). */
        can_block_p->MCTL[mbox_nr].BYTE = 0;


        /*** Set Mailbox ID based on ID mode ***/
        if (frame_p->id & XID_MASK)    /* Check for XID flag bit set in ID field */
        {
            /* Set message mailbox buffer Extended ID, masking off temporary XID flag bit. */
            can_block_p->MB[mbox_nr].ID.LONG = (frame_p->id & (~XID_MASK));

            if (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM)
            {
                can_block_p->MB[mbox_nr].ID.BIT.IDE = 1;   /* Mixed mode; select to send extended frame. */
            }
        }
        else
        {
            /* Set message mailbox buffer Standard ID. Put only the lower 11 bit in the SID. */
            can_block_p->MB[mbox_nr].ID.BIT.SID = (frame_p->id & SID_MASK);

            /* Always set IDE to 0 (unless mixed mode and extended frame as above). */
            can_block_p->MB[mbox_nr].ID.BIT.IDE = 0;
        }

        /* Set the Data Length Code */
        can_block_p->MB[mbox_nr].DLC = (unsigned short)frame_p->dlc;

        /* Frame select: Data frame = 0, Remote = 1 */
        if (REMOTE_FRAME == frame_type)
        {
            can_block_p->MB[mbox_nr].ID.BIT.RTR = 1;
        }
        else
        {
            can_block_p->MB[mbox_nr].ID.BIT.RTR = 0;
        }

        /* Copy frame data into mailbox */
        for (i = 0; ((i < frame_p->dlc) && (i<8)); i++)
        {
            can_block_p->MB[mbox_nr].DATA[i] = frame_p->data[i];
        }

        #if (USE_CAN_POLL == 0)
            /* Interrupt enable the mailbox */
            can_block_p->MIER.LONG |= (bit_set[mbox_nr]);
        #endif

        api_status |= R_CAN_Tx(ch_nr, mb_mode, mbox_nr);
    }
    return (api_status);
}

/******************************************************************************
 End of function R_CAN_TxSet
 *****************************************************************************/ /* end R_CAN_TxSet() */

