district9prawn/rx72t-canbus-demo/trash/2023-11-13-13-29-48/src/smc_gen/r_can_rx/src/r_can_rx.c
/***********************************************************************************************************************
* Function Name: R_CAN_TxSetXid
********************************************************************************************************************//**
* @brief Set up a mailbox to transmit.The API will write to a mailbox the specified ID, data length and data
* frame payload, then set the mailbox to transmit mode and send a frame onto the bus by calling R_CAN_Tx(). If this
* function is used, the ID will be a 29-bit ID.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mb_mode - Normal mailbox (0), FIFO mailbox (1).
* @param[in] mbox_nr - Mailbox to use.
* @param[in] frame_p - Pointer to a data frame structure in memory. It is an address to the data structure containing
* the ID, DLC and data that constitute the dataframe the mailbox will transmit.
* @param[in] frame_type \n
*  DATA_FRAME      Send a normal data frame.\n
*  REMOTE_FRAME    Send a remote data frame request.
* @retval R_CAN_OK                The mailbox was set up for transmission.
* @retval R_CAN_SW_BAD_MBX        Bad mailbox number.
* @retval R_CAN_BAD_CH_NR         The channel number does not exist.
* @retval R_CAN_BAD_MODE          The mode number does not exist.
* @retval CAN_ERR_BOX_FULL        Receive FIFO is full (4 unread messages).
* @retval R_CAN_BAD_ACTION_TYPE   No such action type exists for this function.
* @details This function sets up transmitting for normal mailboxes or transmit FIFO mailboxes.\n
* To transmit FIFO mailboxes, this function first interrupt disables the mailbox temporarily when setting up the maibox.
* It then check to ensure transmit FIFO is not full to perform setting up the mailbox: Copies the data frame payload
* bytes (0-7) into the mailbox, selects data frame or remote frame request, sets the ID value for the mailbox and
* finally the Data Length Code indicated by frame_p. The mailbox is interrupt enabled as well as transmit FIFO interrupt
* generation timing again unless USE_CAN_POLL was defined. Finally R_CAN_Tx is called to deliver the message.\n
* To normal mailboxes, this function first waits for any previous transmission of the specified mailbox to complete.
* It then interrupt disables the mailbox temporarily when setting up the mailbox: Sets the ID value for the mailbox,
* the Data Length Code indicated by frame_p, selects dataframe or remote frame request and finally copies the data frame
* payload bytes (0-7) into the mailbox. The mailbox is interrupt enabled again unless USE_CAN_POLL was defined.
* Finally R_CAN_Tx is called to deliver the message.
*/
uint32_t R_CAN_TxSetXid(const uint32_t     ch_nr,
                        const uint32_t     mb_mode,
                        const uint32_t     mbox_nr,
                        can_frame_t*       frame_p,
                        const uint32_t     frame_type)
{
    can_frame_t temp_frame;
    uint32_t    api_status;

    /* Copy the user frame to a temporary frame to which we add the Xid bit, 
    so that 29-bit ID will be used by R_CAN_TxSet(). The original frame is left 
    untouched (in case user later wants to send the same frame with standard ID). */
    memcpy(&temp_frame, frame_p, sizeof(can_frame_t));

    temp_frame.id |= XID_MASK;    /* Set XID flag bit set in ID field */
    api_status = R_CAN_TxSet(ch_nr, mb_mode, mbox_nr, (can_frame_t*)&temp_frame, frame_type);
           
    return (api_status);
}
/******************************************************************************
 End of function R_CAN_TxSetXid
 *****************************************************************************//* end R_CAN_TxSetXid() */

/***********************************************************************************************************************
* Function Name: R_CAN_Tx
********************************************************************************************************************//**
* @brief Starts actual message transmission onto the CAN bus. This API will wait until the mailbox finishes handling
* a prior frame, then set the mailbox to transmit mode.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mb_mode - Normal mailbox (0), FIFO mailbox (1).
* @param[in] mbox_nr - Which CAN mailbox to use. (0-32)
* @retval R_CAN_OK - The mailbox was set to transmit a previously configured mailbox.
* @retval R_CAN_SW_BAD_MBX - Bad mailbox number.
* @retval R_CAN_BAD_CH_NR - The channel number does not exist.
* @retval R_CAN_BAD_MODE - The mode number does not exist.
* @retval R_CAN_SW_SET_TX_TMO - Waiting for previous transmission to finish timed out.
* @retval R_CAN_SW_SET_RX_TMO - Waiting for previous reception to complete timed out.
* @details R_CAN_TxSet must have been called at least once for this mailbox after system start to set up the mailbox
* content, as this function only tells the mailbox to send its content.
*/
uint32_t R_CAN_Tx(const uint32_t  ch_nr, const uint32_t  mb_mode, const uint32_t  mbox_nr)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t api_status = R_CAN_OK;

     /* check mailbox mode */
     CHECK_MBX_MODE

    /* check mailbox for fifo mode: normal mailbox: 0 --> 23,
     * Transmit fifo mailbox: 24 --> 27;
     * return if number of mailbox is receive fifo mailbox(28 -->31) or higher */
    if(FIFO_MAILBOX_MODE == mb_mode )    /* check normal or fifo mailbox mode */
    {
        /* return if MBX is receive FIFO mailbox */
        CHECK_TXFIFO_MBX_NR
    }
    else
    {
        CHECK_MBX_NR
    }

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }
    if((FIFO_MAILBOX_MODE == mb_mode) && (bit_set[mbox_nr] & 0x0f000000))    /* check normal or fifo mode */
    {
        /* Write FFh to transmit FIFO pointer control register */
        can_block_p->TFPCR = 0xFF;
    }
    else   /* Don't using FIFO mode */
    {
    /* Wait for any previous transmission to complete. */
    api_status = can_wait_tx_rx(ch_nr, mbox_nr);

    /* Clear SentData flag since we are about to send anew.
     * Do a byte-write to avoid read-modify-write with HW writing another bit inbetween. See RX64M/71M UM 43.2.8.
     * TRMREQ/RECREQ already 0 after can_wait_tx_rx(). (No need to write twice). */
    can_block_p->MCTL[mbox_nr].BYTE = 0;

