district9prawn/rx72t-canbus-demo/trash/2023-11-13-13-29-48/src/smc_gen/r_can_rx/src/r_can_rx.c
    /* Check for XID flag bit set in fidcr1_value argument */
    if (fidcr1_value & XID_MASK)
    {
         /* Set message mailbox buffer Extended ID, masking off temporary XID flag bit. */
        can_block_p->FIDCR1.LONG = (fidcr1_value & (~XID_MASK));
    }
    else
    {
        /* Set message mailbox buffer Standard ID */
        can_block_p->FIDCR1.BIT.SID = (fidcr1_value & SID_MASK);
    }

    /* Set IDE bit depending on if want to receive SID or XID frame. Only for mixed mode. */
    if (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM)
    {
        if (fidcr1_value & XID_MASK)
        {
        /* Mixed mode; select to send extended frame. */
        can_block_p->FIDCR1.BIT.IDE = 1;
        }
        else
        {
        /* Always set IDE to 0 (unless mixed mode and extended frame as above). */
        can_block_p->FIDCR1.BIT.IDE = 0;
        }
    }
    else
    {
        /* When not MIXED mode, IDE should be written with 0. */
        can_block_p->FIDCR1.BIT.IDE = 0;
    }

    if ((EXT_ID_MODE == can_block_p->CTLR.BIT.IDFM) || (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM))
    {
        /* Set XID 29-bit mask value in mask register. */
        can_block_p->MKR[6].LONG = (mkr6_value & (~XID_MASK)); /* Set XID 29-bit mask value in mask register 6. */
        can_block_p->MKR[7].LONG = (mkr7_value & (~XID_MASK)); /* Set XID 29-bit mask value in mask register 7. */
    }
    else
    {
        /* Set SID 11-bit mask value in mask register. */
        can_block_p->MKR[6].BIT.SID = mkr6_value; /* Set SID 11-bit mask value in mask register 6. */
        can_block_p->MKR[7].BIT.SID = mkr7_value; /* Set SID 11-bit mask value in mask register 7. */
    }

    /* Set mailbox mask to be used. (0 = mask VALID.).
     *  Set bits 31 to 24 to 0 in FIFO mailbox mode */
    can_block_p->MKIVLR.LONG &= (~(0xFF000000));

    #if (USE_CAN_POLL == 0)
    /* In FIFO mailbox mode, change the bits in MIER for the related FIFO only
     * when the RFE bit in RFCR is 0 and the RFEST flag in RFCR is 1 */
        if((can_block_p->RFCR.BIT.RFE == 0) && (can_block_p->RFCR.BIT.RFEST == 1))
        {
            /* Interrupt enable the mailbox */
            can_block_p->MIER.LONG |= (bit_set[28]);

            /* Generate interrupt when Receive FIFO warning */
            if(CAN_CFG_RXFIFO_INT_GEN_TIMING == 1)
            {
                can_block_p->MIER.LONG |= (bit_set[29]);
            }
        }
    #endif

    /* Receive FIFO enable */
    can_block_p->RFCR.BIT.RFE = 1;

    return (api_status);
}
/******************************************************************************
 End of function R_CAN_RxSetFIFO
 *****************************************************************************/ /* end R_CAN_RxSetFIFO() */

/***********************************************************************************************************************
* Function Name: R_CAN_RxSetXid
********************************************************************************************************************//**
* @brief Set up a mailbox to receive.\n
* The API sets up a given mailbox to receive data frames with the given CAN 11-bit ID. Incoming data frames with the
* same ID will be stored in the mailbox, except the ID will be a 29-bit ID.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr - Which CAN mailbox to use. (0-32)
* @param[in] xid - The CAN ID which the mailbox should receive.
* @param[in] frame_type \n
*  DATA_FRAME      Send a normal data frame. \n
*  REMOTE_FRAME    Send a remote data frame request.
* @retval R_CAN_OK                Action completed successfully.
* @retval R_CAN_SW_BAD_MBX        Bad mailbox number.
* @retval R_CAN_BAD_CH_NR         The channel number does not exist.
* @retval R_CAN_SW_SET_TX_TMO     Waiting for previous transmission to finish timed out.
* @retval R_CAN_SW_SET_RX_TMO     Waiting for previous reception to complete timed out.
* @details The function will first wait for any previous transmission/reception to complete, then temporarily
* interrupt disable the mailbox. It sets the mailbox to the given standard ID value, and whether to receive normal
* CAN dataframes or remote frame requests.
*/
uint32_t R_CAN_RxSetXid(const uint32_t     ch_nr, 
                        const uint32_t     mbox_nr,
                        uint32_t           xid,
                        const uint32_t     frame_type)
{
    /* Add the Xid bit so that 29-bit ID will be used by R_CAN_RxSet(). */
    return (R_CAN_RxSet(ch_nr, mbox_nr, (xid | XID_MASK) , frame_type));
}
/******************************************************************************
 End of function R_CAN_RxSetXid
 *****************************************************************************/ /* end R_CAN_RxSetXid() */

/***********************************************************************************************************************
* Function Name: R_CAN_RxSetFIFOXid
********************************************************************************************************************//**
 * @brief Set up a mailbox to receive.\n
* The API sets up a given FIFO mailbox to receive data frames with the given CAN 29-bit ID. Incoming data frames with
* the same ID will be stored in the mailbox.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mb_mode - Normal mailbox (0), FIFO mailbox (1).
* @param[in] mbox_nr - Which CAN mailbox to use. (0-32)
* @param[in] xfidcr0_value - The CAN ID which the mailbox should receive.
* @param[in] xfidcr1_value - The CAN ID which the mailbox should receive.
* @param[in] mkr6_value - The mask register.
* @param[in] mkr7_value - The mask register.
* @param[in] frame_type \n
*  DATA_FRAME      receive a normal data frame. \n
*  REMOTE_FRAME    receive a remote data frame request.
* @retval R_CAN_OK                Action completed successfully.
* @retval R_CAN_SW_BAD_MBX        Bad mailbox number.
* @retval R_CAN_BAD_CH_NR         The channel number does not exist.
* @retval R_CAN_BAD_MODE          The mode number does not exist.
* @retval CAN_ERR_NOT_FIFO_MODE   Current mailbox mode is not FIFO mailbox mode.
* @details The function will first temporarily interrupt disable the mailbox. Then it sets whether to receive normal
* CAN data frames or remote frame requests. It also sets the FIFO mailbox to the given ID value. Next, it performs
* setting value for mask register, refer to section R_CAN_RxSetMask in the application note for details.
*/
uint32_t R_CAN_RxSetFIFOXid(const uint32_t     ch_nr,
                            const uint32_t     mb_mode,
                            const uint32_t     mbox_nr,
                            uint32_t           xfidcr0_value,
                            uint32_t           xfidcr1_value,
                            const uint32_t     frame_type,
                            const uint32_t     mkr6_value,
                            const uint32_t     mkr7_value)
{
    /* Add the Xid bit so that 29-bit ID will be used by R_CAN_RxSetFIFO(). */
    return (R_CAN_RxSetFIFO(ch_nr, mb_mode, mbox_nr, (xfidcr0_value | XID_MASK), (xfidcr1_value | XID_MASK), frame_type, mkr6_value, mkr7_value));
}
/******************************************************************************
 End of function R_CAN_RxSetFIFOXid
 *****************************************************************************/ /* end R_CAN_RxSetXid() */

