district9prawn/rx72t-canbus-demo/trash/2023-11-13-13-29-48/src/smc_gen/r_can_rx/src/r_can_rx.c
/***********************************************************************************************************************
* Function Name: R_CAN_RxPoll
********************************************************************************************************************//**
* @brief Checks if a mailbox has received a message
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr - Which CAN mailbox to check (0-32).
* @retval R_CAN_OK            There is a message waiting.
* @retval R_CAN_NOT_OK        No message waiting.
* @retval R_CAN_RXPOLL_TMO    Message pending but timed out.
* @retval R_CAN_SW_BAD_MBX    Bad mailbox number.
* @retval R_CAN_BAD_CH_NR     The channel number does not exist.
* @details When a mailbox is set up to receive certain messages, it is important to determine when it has finished
* receiving successfully. There are two methods for doing this: \n
* Polling. Call the API regularly to check for new messages. USE_CAN_POLL must be defined in the CAN configuration
* file. If there is a message use R_CAN_RxRead to fetch it. \n
* Using the CAN receive interrupt (USE_CAN_POLL not defined): Use this API to check which mailbox received. Then
* notify the application. \n
* The function returns R_CAN_OK if new data was found in the mailbox.
*
*/
uint32_t R_CAN_RxPoll(const uint32_t  ch_nr, const uint32_t  mbox_nr)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t api_status = R_CAN_NOT_OK;
    uint32_t poll_delay = MAX_CANREG_POLLCYCLES;

    CHECK_MBX_NR
    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    /* Wait if new data is currently being received. */
    while ((can_block_p->MCTL[mbox_nr].BIT.RX.INVALDATA) && poll_delay)
    {
        poll_delay--;
    }

    if (0 == poll_delay)    /* Still updating mailbox. Come back later. */
    {
        api_status = R_CAN_RXPOLL_TMO;
    }
    else /* Message received? */
    {
        /* If message received, tell user. */
        if (1 == can_block_p->MCTL[mbox_nr].BIT.RX.NEWDATA)
            api_status = R_CAN_OK;
    }
    return (api_status);
}
/******************************************************************************
 End of function R_CAN_RxPoll
 *****************************************************************************//* end R_CAN_RxPoll() */

/***********************************************************************************************************************
* Function Name: R_CAN_RxRead
********************************************************************************************************************//**
* @brief Read the CAN data frame content from a mailbox. The API checks if a given mailbox has received a message.
* If so, a copy of the mailbox’s dataframe will be written to the given structure.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mb_mode - Normal mailbox (0), FIFO mailbox (1).
* @param[in] mbox_nr - Which CAN mailbox to check (0-32).
* @param[in] frame_p - Refers to a pointer to a data frame structure in memory. It is an address to the data structure
*                       into which the function will place a copy of the mailbox’s received CAN data frame.
* @retval R_CAN_OK            There is a message waiting.
* @retval R_CAN_BAD_MODE      The mode number does not exist.
* @retval R_CAN_SW_BAD_MBX    Bad mailbox number.
* @retval R_CAN_BAD_CH_NR     The channel number does not exist.
* @retval CAN_ERR_BOX_EMPTY   No unread message in receive FIFO.
* @retval R_CAN_MSGLOST       Message was overwritten or lost.
* @details This function is used to receive the message by the normal mailboxes or receive FIFO mailboxes.\n
To receive FIFO mailboxes, it checks Receive FIFO Empty Status Flag to ensure unread message in receive FIFO.
If have, it loads the ID value, the Data Length Code and the data frame payload bytes (0-7) of message into the mailbox.
Finally, it checks Message Lost then write FF to Receive FIFO Pointer Control Register.\n
To normal mailboxes, Use R_CAN_RxPoll() first to check whether the mailbox has received a message.\n
This function is used to fetch the message from a mailbox, either when using polled mode or from a CAN receive interrupt.
*/
uint32_t R_CAN_RxRead(const uint32_t       ch_nr,
                      const uint32_t       mb_mode,
                      const uint32_t       mbox_nr,
                      can_frame_t* const   frame_p)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t i;
    uint32_t api_status = R_CAN_OK;

    /* check mailbox mode*/
    CHECK_MBX_MODE

    /* check mailbox for fifo mailbox mode:
     * Normal mailbox: 0 --> 23,
     * Receive fifo mailbox: 28 --> 31;
     * return if number of mailbox is transmit fifo mailbox(24 -->27) or other mailbox */
    if(FIFO_MAILBOX_MODE == mb_mode )    /* check normal or fifo mailbox mode */
    {
        /* return if MBX is receive FIFO mailbox */
        CHECK_RXFIFO_MBX_NR
    }
    else
    {
    CHECK_MBX_NR
    }

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    if((FIFO_MAILBOX_MODE == mb_mode) && (bit_set[mbox_nr] & 0xf0000000))    /* check normal or fifo mode */
    {
        /* return if FIFO is empty */
        if(can_block_p->RFCR.BIT.RFEST)
        {
            return (CAN_ERR_BOX_EMPTY);
        }

        /* EXT_ID_MODE */
        /* Copy received data from message mailbox to memory. The IDE bit is only valid in mixed mode. */
        if (EXT_ID_MODE == can_block_p->CTLR.BIT.IDFM)
        {
            /* Get mailbox Extended ID, keeping only lower 29 bits. */
            frame_p->id = (can_block_p->MB[28].ID.LONG & (~XID_MASK));
        }
        /* MIXED_ID_MODE */
        else if (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM)
        {
            if (1 == can_block_p->MB[28].ID.BIT.IDE) /* Check for XID control bit set. */
            {
                /* Get mailbox Extended ID, keeping only lower 29 bits. */
                frame_p->id = (can_block_p->MB[28].ID.LONG & (~XID_MASK));
            }
            else
            {
                /* Get only the lower 11 bits from the SID. */
                frame_p->id = can_block_p->MB[28].ID.BIT.SID;
            }
        }
        /* STD_ID_MODE */
        else
        {
            /* Get lower 11 bits from SID. */
            frame_p->id = can_block_p->MB[28].ID.BIT.SID;
        }

