district9prawn/rx72t-canbus-demo/trash/2023-11-13-13-29-48/src/smc_gen/r_can_rx/src/r_can_rx.c
        frame_p->dlc = (uint8_t)can_block_p->MB[28].DLC;

        for (i = 0; i < can_block_p->MB[mbox_nr].DLC; i++)
        {
            frame_p->data[i] = can_block_p->MB[28].DATA[i];
        }
         /* check receive FIFO message lost */
        if(can_block_p->RFCR.BIT.RFMLF)
        {
            /* Clear receive FIFO message lost flag to 0 */
            can_block_p->RFCR.BYTE = 0x01;
            api_status = R_CAN_MSGLOST;
        }

        /* Write FFh to receive FIFO pointer control register */
        can_block_p->RFPCR = 0xFF;
    }

    /* Content of below else will occur in 2 case:
     * 1: Read message by MBX normal in FIFO mailbox mode when FIFO_MAILBOX_MODE == mb_mode
       2: Read message by MBX normal in normal mailbox mode when FIFO_MAILBOX_MODE != mb_mode */
    else
    {
        /* EXT_ID_MODE */
        /* Copy received data from message mailbox to memory. The IDE bit is only valid in mixed mode. */
        if (EXT_ID_MODE == can_block_p->CTLR.BIT.IDFM)
        {
            /* Get mailbox Extended ID, keeping only lower 29 bits. */
            frame_p->id = (can_block_p->MB[mbox_nr].ID.LONG & (~XID_MASK));
        }
        /* MIXED_ID_MODE */
        else if (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM)
        {
            if (1 == can_block_p->MB[mbox_nr].ID.BIT.IDE) /* Check for XID control bit set. */
            {
                /* Get mailbox Extended ID, keeping only lower 29 bits. */
                frame_p->id = (can_block_p->MB[mbox_nr].ID.LONG & (~XID_MASK));
            }
            else
            {
                /* Get only the lower 11 bits from the SID. */
                frame_p->id = can_block_p->MB[mbox_nr].ID.BIT.SID;
            }
        }
        /* STD_ID_MODE */
        else
        {
            /* Get lower 11 bits from SID. */
            frame_p->id = can_block_p->MB[mbox_nr].ID.BIT.SID;
        }

        frame_p->dlc = (uint8_t)can_block_p->MB[mbox_nr].DLC;

        for (i = 0; i < can_block_p->MB[mbox_nr].DLC; i++)
        {
            frame_p->data[i] = can_block_p->MB[mbox_nr].DATA[i];
        }

        /* Check if message was lost/overwritten. */
        if (can_block_p->MCTL[mbox_nr].BIT.RX.MSGLOST)
        {
            api_status = R_CAN_MSGLOST;
        }

        /* Clear MSGLOST.
         * Also set NEWDATA to 0 since the mailbox was just emptied and start over with new RxPolls.
         * Do a byte-write to avoid read-modify-write with HW writing another bit inbetween. See RX64M/71M UM 43.2.8.*/
        can_block_p->MCTL[mbox_nr].BYTE = 0x40;
    }

    return (api_status);
}
/******************************************************************************
 End of function R_CAN_RxRead
 *****************************************************************************//* end R_CAN_RxRead() */

/***********************************************************************************************************************
* Function Name: R_CAN_RxSetMask
********************************************************************************************************************//**
* @brief Sets the CAN ID Acceptance Masks. To accept only one ID, set mask to all ones. To accept all messages, set
* mask to all zeros. To accept a range of messages, set the corresponding ID bits to zero.
* @param[in] ch_nr -  CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr - Which mailbox to mask (0-32). Four mailboxes will be affected within its group.
* @param[in] mask_value - Mask value. (0-0x7FF)
* @details Receive mailboxes can use a mask to filter out one message, or expand receiving to a range of messages
* (CAN IDs). The mask enables this using the mailbox group’s ID field. There is one mask for mailbox 0-3, one
* for 4-7, etc. Changing a mask will therefore affect the behavior of adjacent mailboxes. \n
*  Each '0' in the mask means "mask this bit", or "don't look at that bit"; accept anything.\n
*  Each '1' means check if the CAN-ID bit in this position matches the CAN-ID of the mailbox.\n
*  See section R_CAN_RxSetMask in the application note for details.
*/
void R_CAN_RxSetMask( const uint32_t  ch_nr,
                      const uint32_t  mbox_nr,
                      const uint32_t  mask_value)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return;
    }
    /* Shift to CAN Halt mode only when the CAN operation mode is not Halt or Reset */
    if((CAN_RESET != can_block_p->CTLR.BIT.CANM) && (CAN_HALT != can_block_p->CTLR.BIT.CANM))
    {
        /* Write to MKR0 to MKR7 in CAN reset mode or CAN halt mode.*/
        R_CAN_Control(ch_nr, HALT_CANMODE);
    }

    /* Set mask for the group of mailboxes. */
    if ((EXT_ID_MODE == can_block_p->CTLR.BIT.IDFM) || (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM))
    {
        /* Set XID 29-bit mask value in mask register. */
        can_block_p->MKR[mbox_nr/4].LONG = (mask_value & (~XID_MASK));
    }
    else
    {
        /* Set SID 11-bit mask value in mask register. */
        can_block_p->MKR[mbox_nr/4].BIT.SID = mask_value;
    }

    /* Set mailbox mask to be used. (0 = mask VALID.) */
    can_block_p->MKIVLR.LONG &= (~(bit_set[mbox_nr]));

}
/******************************************************************************
 End of function R_CAN_RxSetMask
 *****************************************************************************//* end R_CAN_RxSetMask() */

/*****************************************************************************
Function name:  can_wait_tx_rx
Arguments:      Channel nr.
                Mailbox nr.
Description:    Wait for communicating mailbox to complete action. This would 
                be apporopriate for example if a mailbox all of a sudden needs 
                to be reconfigured but the user wants any pending receive or 
                transmit to finish.
Return value:   R_CAN_OK            There is a message waiting.
                R_CAN_SW_BAD_MBX    Bad mailbox number.
                R_CAN_BAD_CH_NR     The channel number does not exist.
                R_CAN_SW_SET_TX_TMO Waiting for previous transmission to finish 
                                    timed out.
                R_CAN_SW_SET_RX_TMO Waiting for previous reception to complete 
                                    timed out.
*****************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(can_wait_tx_rx)
uint32_t can_wait_tx_rx(const uint32_t  ch_nr, const uint32_t  mbox_nr)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t api_status = R_CAN_OK;
    uint32_t can_tmo_cnt = MAX_CAN_SW_DELAY;

    /* Mailbox and channel nr already checked by caller. */
    can_block_p = CAN_CHANNELS[ch_nr];

