district9prawn/rx72t-canbus-demo/trash/2023-11-13-13-29-48/src/smc_gen/r_can_rx/src/r_can_rx.c
    /* Wait for any previous transmission to complete. */
    if (can_block_p->MCTL[mbox_nr].BIT.TX.TRMREQ)
    {
        while ((0 == can_block_p->MCTL[mbox_nr].BIT.TX.SENTDATA) && DEC_CHK_CAN_SW_TMR)
            {;}
        if (0 == can_tmo_cnt)
        {
            api_status = R_CAN_SW_SET_TX_TMO;
        }
    }
    /* Wait for any previous reception to complete. */
    else if (can_block_p->MCTL[mbox_nr].BIT.RX.RECREQ)
    {
        while ((1 == can_block_p->MCTL[mbox_nr].BIT.RX.INVALDATA) && DEC_CHK_CAN_SW_TMR)
        {;}
        if (0 == can_tmo_cnt)
        {
            api_status = R_CAN_SW_SET_RX_TMO;
        }
    }
    return (api_status);
}
/******************************************************************************
 End of function can_wait_tx_rx
 *****************************************************************************/
/* end can_wait_tx_rx() */

/***********************************************************************************************************************
* Function Name: R_CAN_CheckErr
********************************************************************************************************************//**
* @brief Check for bus errors. The API checks the CAN status, or Error State, of the CAN peripheral.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @retval R_CAN_BAD_CH_NR               The channel number does not exist.
* @retval R_CAN_STATE_ERROR_ACTIVE      CAN bus status is normal.
* @retval R_CAN_STATE_ERROR_PASSIVE     Node has sent at least 127 Error frames for either the Transmit Error Counter,
*                                       or the Receive Error Counter.
* @retval R_CAN_STATE_BUSOFF            Node’s Transmit Error Counter has surpassed 255 due to the node’s failure to
*                                       transmit correctly.
* @details The API checks the CAN status flags of the CAN peripheral and returns the status error code. It tells
* whether the node is in a functioning state or not and is used for application error handling.\n
* It should be polled either routinely from the main loop, or via the CAN error interrupt. Since the peripheral
* automatically handles retransmissions and Error frames it is usually of no advantage to include an error interrupt
* routine. \n
* If an error state is encountered the application can just wait and monitor for the peripheral to recover, as the
* CAN peripheral takes itself on or off line depending on its state. After a recovery is discovered, the application
* should restart.\n
* See section R_CAN_CheckErr in the application note for details.
*/
uint32_t R_CAN_CheckErr(const uint32_t ch_nr)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t api_status = R_CAN_STATUS_ERROR_ACTIVE;

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    /* Check CAN error state */
    if (can_block_p->STR.BIT.EST)
    {
        /* Check error-passive state */
        if (can_block_p->STR.BIT.EPST)
        {
            api_status = R_CAN_STATUS_ERROR_PASSIVE;
        }
        /* Check if bus off state */
        else if (can_block_p->STR.BIT.BOST)
        {
            api_status = R_CAN_STATUS_BUSOFF;
        }
        else
        {
            /* Keep api_status as R_CAN_STATUS_ERROR_ACTIVE */
        }
    }
    
    return (api_status);
}
/******************************************************************************
 End of function R_CAN_CheckErr
 *****************************************************************************//* end R_CAN_CheckErr() */

/***********************************************************************************************************************
* Function Name: R_CAN_SetBitrate
********************************************************************************************************************//**
* @brief Set the CAN bitrate (communication speed). The baud rate and bit timing must always be set during the
* configuration process. It can be changed later if reset mode is entered.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] p_cfg - It is an address to the data structure containing the BRP, TSEG1, TSEG2, and SJW that constitute
* the bitrate for channel ch_nr.
* @details Setting the baud rate or data speed on the CAN bus requires some understanding of CAN bit timing and MCU
* frequency, as well as reading hardware manual figures and tables.\n
* Some calculations need to be done to set up the baud rate: Selects the baud rate prescaler division value, time
* segment 2 control, time segment 1 control, and resynchronization jump width control indicated by p_cfg.
* First some explanations. The CAN system clock, fcanclk, is the internal clock period of the CAN peripheral.
* This CAN system clock is determined by the CAN Baud Rate Prescaler value and the peripheral bus clock. One Time
* Quantum is equal to the period of the CAN clock.\n
* One CAN bus bit-time is an integer sum of a number of Time Quanta, Tq. Each bitrate register is then given a
* certain number of Tq of the total number of Time Quanta that make up one CAN bit period, or Tqtot.\n
* See section R_CAN_SetBitrate in the application note for details.
*/
void R_CAN_SetBitrate(const uint32_t ch_nr, const can_bitrate_config_t p_cfg)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return;
    }

    /* Shift to CAN Reset mode only when the CAN operation mode is not Reset */
    if(CAN_RESET != can_block_p->CTLR.BIT.CANM)
    {
        /* Change to Reset mode */
        R_CAN_Control(ch_nr, RESET_CANMODE);
    }

    /* Set CAN clock select to be either PLL (default) or crystal direct. */
    can_block_p->BCR.BIT.CCLKS = 0; /* 0 = PLL. */

    /* Set TSEG1, TSEG2 and SJW. */
    can_block_p->BCR.BIT.BRP = p_cfg.BRP - 1;
    can_block_p->BCR.BIT.TSEG1 = p_cfg.TSEG1 - 1;
    can_block_p->BCR.BIT.TSEG2 = p_cfg.TSEG2 - 1;
    can_block_p->BCR.BIT.SJW = p_cfg.SJW - 1;
}
/******************************************************************************
 End of function R_CAN_SetBitrate
 *****************************************************************************/ /* end R_CAN_SetBitrate() */

