district9prawn/rx72t-canbus-demo/trash/2023-11-13-13-29-48/src/smc_gen/r_can_rx/src/r_can_rx.c
        /* Mailbox interrupt enable registers. Disable interrupts for all slots.
        They will be enabled individually by the API. */
        CAN2.MIER.LONG = 0x00000000;
    }
#endif /* CAN_USE_CAN2 */
#endif /* CAN2 */
#endif /* USE_CAN_POLL */
}
/******************************************************************************
 End of function config_can_interrupts
 *****************************************************************************//* end config_can_interrupts() */

#if !USE_CAN_POLL
/*********************************************************************************


        C A N   I N T E R R U P T S


**********************************************************************************/
#if (CAN_USE_CAN0 == 1)
/*****************************************************************************
Function name:  CAN0_TXM0_ISR
Parameters:     -
Returns:        -
Description:    CAN0 Transmit interrupt (channel 0).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN0_TXM0_ISR, VECT_CAN0_TXM0)    /* See mcu_mapped_interrupts.h. */
R_BSP_ATTRIB_INTERRUPT void CAN0_TXM0_ISR(void)
{
    can_tx_callback[0]();
}
/******************************************************************************
 End of function CAN0_TXM0_ISR
 *****************************************************************************//* end CAN0_TXM0_ISR() */

/*****************************************************************************
Function name:  CAN0_TXF0_ISR
Parameters:     -
Returns:        -
Description:    CAN0 fifo Transmit interrupt (channel 0).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN0_TXF0_ISR, VECT_CAN0_TXF0)    /* See mcu_mapped_interrupts.h. */
R_BSP_ATTRIB_INTERRUPT void CAN0_TXF0_ISR(void)
{
    can_txf_callback[0]();
}
/******************************************************************************
 End of function CAN0_TXF0_ISR
 *****************************************************************************//* end CAN0_TXF0_ISR() */

/*****************************************************************************
Function name:  CAN0_RXM0_ISR()
Parameters:     -
Returns:        -
Description:    CAN0 Receive interrupt (channel 1).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN0_RXM0_ISR, VECT_CAN0_RXM0)
R_BSP_ATTRIB_INTERRUPT void CAN0_RXM0_ISR(void)
{
    can_rx_callback[0]();
}
/******************************************************************************
 End of function CAN0_RXM0_ISR
 *****************************************************************************//* end CAN0_RXM0_ISR() */

/*****************************************************************************
Function name:  CAN0_RXF0_ISR()
Parameters:     -
Returns:        -
Description:    CAN0 fifo Receive interrupt (channel 1).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN0_RXF0_ISR, VECT_CAN0_RXF0)
R_BSP_ATTRIB_INTERRUPT void CAN0_RXF0_ISR(void)
{
    can_rxf_callback[0]();
}
/******************************************************************************
 End of function CAN0_RXM0_ISR
 *****************************************************************************//* end CAN0_RXF0_ISR() */
#endif /* CAN_USE_CAN0 */
#ifdef CAN1
#if (CAN_USE_CAN1 == 1)
/*****************************************************************************
Function name:  CAN1_TXM1_ISR
Parameters:     -
Returns:        -
Description:    CAN1 Transmit interrupt (channel 1).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN1_TXM1_ISR, VECT_CAN1_TXM1)
R_BSP_ATTRIB_INTERRUPT void CAN1_TXM1_ISR(void)
{
    can_tx_callback[1]();
}
/******************************************************************************
 End of function CAN1_TXM1_ISR
 *****************************************************************************/ /* end CAN1_TXM1_ISR() */

/*****************************************************************************
Function name:  CAN0_TXF1_ISR
Parameters:     -
Returns:        -
Description:    CAN0 fifo Transmit interrupt (channel 1).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN1_TXF1_ISR, VECT_CAN1_TXF1)    /* See mcu_mapped_interrupts.h. */
R_BSP_ATTRIB_INTERRUPT void CAN1_TXF1_ISR(void)
{
    can_txf_callback[1]();
}
/******************************************************************************
 End of function CAN1_TXF1_ISR
 *****************************************************************************//* end CAN1_TXF1_ISR() */

/*****************************************************************************
Function name:  CAN1_RXM1_ISR()
Parameters:     -
Returns:        -
Description:    CAN1 Receive interrupt (channel 1).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN1_RXM1_ISR, VECT_CAN1_RXM1)
R_BSP_ATTRIB_INTERRUPT void CAN1_RXM1_ISR(void)
{
    can_rx_callback[1]();
}
/******************************************************************************
 End of function CAN1_RXM1_ISR
 *****************************************************************************/ /* end CAN1_RXM1_ISR() */

/*****************************************************************************
Function name:  CAN1_RXF1_ISR()
Parameters:     -
Returns:        -
Description:    CAN1 fifo Receive interrupt (channel 1).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN1_RXF1_ISR, VECT_CAN1_RXF1)
R_BSP_ATTRIB_INTERRUPT void CAN1_RXF1_ISR(void)
{
    can_rxf_callback[1]();
}
/******************************************************************************
 End of function CAN1_RXF1_ISR
 *****************************************************************************/ /* end CAN1_RXF1_ISR() */
#endif /* CAN_USE_CAN1 */
#endif /* CAN1 */

#ifdef CAN2
#if (CAN_USE_CAN2 == 1)
/*Function name:  CAN2_TXM2_ISR
Parameters:     -
Returns:        -
Description:    CAN2 Transmit interrupt (channel 2).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN2_TXM2_ISR, VECT_CAN2_TXM2)    /* See mcu_mapped_interrupts.h. */
R_BSP_ATTRIB_INTERRUPT void CAN2_TXM2_ISR(void)
{
    can_tx_callback[2]();
}
/******************************************************************************
 End of function CAN2_TXM2_ISR
 *****************************************************************************/ /* end CAN2_TXM2_ISR() */

/*Function name:  CAN2_TXF2_ISR
Parameters:     -
Returns:        -
Description:    CAN2 fifo Transmit interrupt (channel 2).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN2_TXF2_ISR, VECT_CAN2_TXF2)    /* See mcu_mapped_interrupts.h. */
R_BSP_ATTRIB_INTERRUPT void CAN2_TXF2_ISR(void)
{
    can_txf_callback[2]();
}
/******************************************************************************
 End of function CAN2_TXF2_ISR
 *****************************************************************************/ /* end CAN2_TXF2_ISR() */

/*****************************************************************************
Name:           CAN2_RXM2_ISR()
Parameters:     -
Returns:        -
Description:    CAN2 Receive interrupt (channel 2).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN2_RXM2_ISR, VECT_CAN2_RXM2)    /* See mcu_mapped_interrupts.h. */
R_BSP_ATTRIB_INTERRUPT void CAN2_RXM2_ISR(void)
{
    can_rx_callback[2]();
}
/******************************************************************************
 End of function CAN2_RXM2_ISR
 *****************************************************************************//* end CAN2_RXM2_ISR() */

/*****************************************************************************
Name:           CAN2_RXF2_ISR()
Parameters:     -
Returns:        -
Description:    CAN2 fifo Receive interrupt (channel 2).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN2_RXF2_ISR, VECT_CAN2_RXF2)    /* See mcu_mapped_interrupts.h. */
R_BSP_ATTRIB_INTERRUPT void CAN2_RXF2_ISR(void)
{
    can_rxf_callback[2]();
}
/******************************************************************************
 End of function CAN2_RXR2_ISR
 *****************************************************************************//* end CAN2_RXR2_ISR() */
#endif /* CAN_USE_CAN2 */
#endif /* CAN2 */

#endif /* USE_CAN_POLL */

/*****************************************************************************
Function name:  universal_can_callback
Parameters:     -
Returns:        -
Description:    Callback in case user did not provide one. Will execute for
                ALL CAN interrupts! Probably not what you want. See CAN API
                application note.
*****************************************************************************/
void universal_can_callback(void)
{
    R_BSP_NOP();
}
/******************************************************************************
 End of function universal_can_callback
 *****************************************************************************/
/* end universal_can_callback() */

/* file end */
